Revit 2026 API

# UV(Double, Double) Constructor

---

Creates a UV with the supplied coordinates.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public UV(
	double u,
	double v
)
```
```vb
Public Sub New (
	u As Double,
	v As Double
)
```
```cpp
public:
UV(
	double u,
	double v
)
```
```fsharp
new :
        u : float *
        v : float -> UV
```

#### Parameters

u Double
    The first coordinate.
v Double
    The second coordinate.

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when setting an infinite number to the U or V property. |

#### Reference

UV Class

UV Overload

Autodesk.Revit.DB Namespace